import { FaFacebook, FaInstagram, FaTwitter, FaYoutube } from "react-icons/fa";
export const roomLists = [
  {
    id: 2,
    name: "ก้นครัว",
    name_en: "food",
    slug: "food",
    is_pinned: false,
    imageUrl: "https://ptcdn.info/mobile/icon_room/pt-forum-food.svg",
    description: "ร้านอาหาร สูตรอาหาร อาหารคาว อาหารหวาน เบเกอรี่ ไอศกรีม",
  },
  {
    id: 25,
    name: "สีลม",
    name_en: "silom",
    slug: "silom",
    is_pinned: false,
    imageUrl: "https://ptcdn.info/mobile/icon_room/pt-forum-silom.svg",
    description:
      "การบริหารจัดการ การตลาด ทรัพยากรบุคคล งานขาย SME ภาษีนิติบุคคล",
  },
  {
    id: 99,
    name: "ไร้สังกัด",
    name_en: "isolate",
    slug: "isolate",
    is_pinned: false,
    imageUrl: "https://ptcdn.info/mobile/icon_room/pt-forum-isolate.svg",
    description: "กระทู้อื่นๆ ที่ไม่สังกัดห้องไหนเลย",
  },
  {
    id: 5,
    name: "จตุจักร",
    name_en: "jatujak",
    slug: "jatujak",
    is_pinned: false,
    imageUrl: "https://ptcdn.info/mobile/icon_room/pt-forum-jatujak.svg",
    description:
      "สัตว์เลี้ยง สุนัข แมว ต้นไม้ จัดสวน ของสะสม งานฝีมือ เกษตรกรรม",
  },
  {
    id: 32,
    name: "บางรัก",
    name_en: "bangrak",
    slug: "bangrak",
    is_pinned: false,
    imageUrl: "https://ptcdn.info/mobile/icon_room/pt-forum-bangrak.svg",
    description: "ความรัก แต่งงาน พรีเวดดิ้ง ปัญหาชีวิตคู่",
  },
  {
    id: 23,
    name: "สวนลุมพินี",
    name_en: "lumpini",
    slug: "lumpini",
    is_pinned: false,
    imageUrl: "https://ptcdn.info/mobile/icon_room/pt-forum-lumpini.svg",
    description:
      "สุขภาพกาย สุขภาพจิต โรคมะเร็ง โรคไมเกรน โรคภูมิแพ้ ปวดประจำเดือน",
  },
  {
    id: 7,
    name: "เฉลิมไทย",
    name_en: "chalermthai",
    slug: "chalermthai",
    is_pinned: false,
    imageUrl: "https://ptcdn.info/mobile/icon_room/pt-forum-chalermthai.svg",
    description: "ภาพยนตร์ ดาราภาพยนตร์ ค่ายหนัง เทศกาลหนัง หนังสั้น",
  },
  {
    id: 100,
    name: "รวมมิตร",
    name_en: "all",
    slug: "",
    is_pinned: false,
    imageUrl: "https://ptcdn.info/mobile/icon_room/pt-forum-all.svg",
    description: "รวมกระทู้จากทุกห้อง",
  },
  {
    id: 21,
    name: "ศุภชลาศัย",
    name_en: "supachalasai",
    slug: "supachalasai",
    is_pinned: false,
    imageUrl: "https://ptcdn.info/mobile/icon_room/pt-forum-supachalasai.svg",
    description: "กีฬา ฟุตบอล บาสเกตบอล มวยสากล กอล์ฟ จักรยาน นักกีฬา",
  },
  {
    id: 24,
    name: "สินธร",
    name_en: "sinthorn",
    slug: "sinthorn",
    is_pinned: false,
    imageUrl: "https://ptcdn.info/mobile/icon_room/pt-forum-sinthorn.svg",
    description: "หุ้น เศรษฐกิจ การลงทุน LTF RMF ธนาคาร เงินตราต่างประเทศ",
  },
  {
    id: 26,
    name: "หว้ากอ",
    name_en: "wahkor",
    slug: "wahkor",
    is_pinned: false,
    imageUrl: "https://ptcdn.info/mobile/icon_room/pt-forum-wahkor.svg",
    description: "วิทยาศาสตร์ วิศวกรรม เทคโนโลยี ฟิสิกส์ ดาราศาสตร์ อวกาศ",
  },
  {
    id: 20,
    name: "ศาสนา",
    name_en: "religious",
    slug: "religious",
    is_pinned: false,
    imageUrl: "https://ptcdn.info/mobile/icon_room/pt-forum-religious.svg",
    description: "ศาสนาพุทธ ศาสนาคริสต์ ศาสนาอิสลาม เที่ยววัด ทำบุญ",
  },
  {
    id: 4,
    name: "ไกลบ้าน",
    name_en: "klaibann",
    slug: "klaibann",
    is_pinned: false,
    imageUrl: "https://ptcdn.info/mobile/icon_room/pt-forum-klaibann.svg",
    description: "เรียนต่อต่างประเทศ ทำงานต่างประเทศ วีซ่า",
  },
  {
    id: 33,
    name: "พรหมชาติ",
    name_en: "horoscope",
    slug: "horoscope",
    is_pinned: false,
    imageUrl: "https://ptcdn.info/mobile/icon_room/pt-forum-horoscope.svg",
    description: "ดูดวง ฮวงจุ้ย ไพ่ยิปซี ทำนายฝัน พระเครื่อง",
  },
  {
    id: 8,
    name: "ชานเรือน",
    name_en: "family",
    slug: "family",
    is_pinned: false,
    imageUrl: "https://ptcdn.info/mobile/icon_room/pt-forum-family.svg",
    description: "ครอบครัว ตั้งครรภ์ ตั้งชื่อลูก การเลี้ยงลูก การสอนลูก",
  },
  {
    id: 22,
    name: "สยามสแควร์",
    name_en: "siam",
    slug: "siam",
    is_pinned: false,
    imageUrl: "https://ptcdn.info/mobile/icon_room/pt-forum-siam.svg",
    description:
      "ชีวิตวัยรุ่น การเรียน โรงเรียน มหาวิทยาลัย ความรักวัยรุ่น เกม",
  },
  {
    id: 34,
    name: "ดิโอลด์สยาม",
    name_en: "theoldsiam",
    slug: "theoldsiam",
    is_pinned: false,
    imageUrl: "https://ptcdn.info/mobile/icon_room/pt-forum-theoldsiam.svg",
    description:
      "ผู้สูงอายุ สุขภาพผู้สูงอายุ ชีวิตหลังเกษียณ สิทธิผู้สูงอายุ ท่องเที่ยวผู้สูงอายุ",
  },
  {
    id: 11,
    name: "โต๊ะเครื่องแป้ง",
    name_en: "beauty",
    slug: "beauty",
    is_pinned: false,
    imageUrl: "https://ptcdn.info/mobile/icon_room/pt-forum-beauty.svg",
    description: "เครื่องสำอาง เสริมสวย แฟชั่น เครื่องประดับ ลดความอ้วน",
  },
  {
    id: 6,
    name: "เฉลิมกรุง",
    name_en: "chalermkrung",
    slug: "chalermkrung",
    is_pinned: false,
    imageUrl: "https://ptcdn.info/mobile/icon_room/pt-forum-chalermkrung.svg",
    description: "นักร้องนักดนตรี เพลง เครื่องดนตรี คอนเสิร์ต มิวสิควิดีโอ",
  },
  {
    id: 3,
    name: "แกลเลอรี่",
    name_en: "gallery",
    slug: "gallery",
    is_pinned: false,
    imageUrl: "https://ptcdn.info/mobile/icon_room/pt-forum-gallery.svg",
    description: "ภาพถ่ายบุคคล ภาพถ่ายทิวทัศน์ ภาพถ่ายมาโคร",
  },
  {
    id: 31,
    name: "บางขุนพรหม",
    name_en: "tvshow",
    slug: "tvshow",
    is_pinned: false,
    imageUrl: "https://ptcdn.info/mobile/icon_room/pt-forum-tvshow.svg",
    description: "ละคร นักแสดง ซีรี่ส์ รายการโทรทัศน์ สถานีโทรทัศน์",
  },
  {
    id: 16,
    name: "มาบุญครอง",
    name_en: "mbk",
    slug: "mbk",
    is_pinned: false,
    imageUrl: "https://ptcdn.info/mobile/icon_room/pt-forum-mbk.svg",
    description: "โทรศัพท์มือถือ Smartphone Tablet iOS Android",
  },
  {
    id: 1,
    name: "กล้อง",
    name_en: "camera",
    slug: "camera",
    is_pinned: false,
    imageUrl: "https://ptcdn.info/mobile/icon_room/pt-forum-camera.svg",
    description: "กล้องถ่ายรูป กล้อง DSLR กล้องวิดีโอ เทคนิคการถ่ายรูป",
  },
  {
    id: 9,
    name: "ชายคา",
    name_en: "home",
    slug: "home",
    is_pinned: false,
    imageUrl: "https://ptcdn.info/mobile/icon_room/pt-forum-home.svg",
    description:
      "บ้าน คอนโดมิเนียม ตกแต่งบ้าน เฟอร์นิเจอร์ เครื่องใช้ไฟฟ้า เครื่องครัว",
  },
  {
    id: 10,
    name: "ซิลิคอนวัลเลย์",
    name_en: "siliconvalley",
    slug: "siliconvalley",
    is_pinned: false,
    imageUrl: "https://ptcdn.info/mobile/icon_room/pt-forum-siliconvalley.svg",
    description:
      "คอมมือใหม่ อินเทอร์เน็ต ซอฟต์แวร์ ฮาร์ดแวร์ เกม เขียนโปรแกรม Gadget",
  },
  {
    id: 12,
    name: "ถนนนักเขียน",
    name_en: "writer",
    slug: "writer",
    is_pinned: false,
    imageUrl: "https://ptcdn.info/mobile/icon_room/pt-forum-writer.svg",
    description: "แต่งนิยาย เรื่องสั้น กลอน นิทาน",
  },
  {
    id: 13,
    name: "บลูแพลนเน็ต",
    name_en: "blueplanet",
    slug: "blueplanet",
    is_pinned: false,
    imageUrl: "https://ptcdn.info/mobile/icon_room/pt-forum-blueplanet.svg",
    description:
      "เที่ยวไทย เที่ยวต่างประเทศ ทะเล ภูเขา เกาะ น้ำตก ดำน้ำ สายการบิน",
  },
  {
    id: 14,
    name: "พันทิป",
    name_en: "pantip",
    slug: "pantip",
    is_pinned: false,
    imageUrl: "https://ptcdn.info/mobile/icon_room/pt-forum-pantip.svg",
    description: "ข้อเสนอแนะถึงพันทิป วิธีการใช้งานพันทิป กิจกรรมพันทิป",
  },
  {
    id: 15,
    name: "ภูมิภาค",
    name_en: "region",
    slug: "region",
    is_pinned: false,
    imageUrl: "https://ptcdn.info/mobile/icon_room/pt-forum-region.svg",
    description: "ภาคเหนือ ภาคอีสาน ภาคกลาง ภาคตะวันออก ภาคตะวันตก ภาคใต้",
  },
  {
    id: 17,
    name: "รัชดา",
    name_en: "ratchada",
    slug: "ratchada",
    is_pinned: false,
    imageUrl: "https://ptcdn.info/mobile/icon_room/pt-forum-ratchada.svg",
    description: "รถยนต์ มอเตอร์ไซค์ เครื่องเสียงรถยนต์ แต่งรถ การจราจร",
  },
  {
    id: 18,
    name: "ราชดำเนิน",
    name_en: "rajdumnern",
    slug: "rajdumnern",
    is_pinned: false,
    imageUrl: "https://ptcdn.info/mobile/icon_room/pt-forum-rajdumnern.svg",
    description:
      "การเมือง รัฐศาสตร์ กฎหมาย สภาผู้แทน รัฐบาล ฝ่ายค้าน พรรคการเมือง",
  },
  {
    id: 19,
    name: "ศาลาประชาคม",
    name_en: "social",
    slug: "social",
    is_pinned: false,
    imageUrl: "https://ptcdn.info/mobile/icon_room/pt-forum-social.svg",
    description: "กฎหมาย ปัญหาสังคม ปัญหาชีวิต เศรษฐกิจ คุ้มครองผู้บริโภค",
  },
  {
    id: 27,
    name: "ห้องสมุด",
    name_en: "library",
    slug: "library",
    is_pinned: false,
    imageUrl: "https://ptcdn.info/mobile/icon_room/pt-forum-library.svg",
    description:
      "หนังสือ หนังสือนิยาย ภาษาไทย ภาษาจีน ภาษาอังกฤษ ปรัชญา ประวัติศาสตร์",
  },
  {
    id: 28,
    name: "กรีนโซน",
    name_en: "greenzone",
    slug: "greenzone",
    is_pinned: false,
    imageUrl: "https://ptcdn.info/mobile/icon_room/pt-forum-greenzone.svg",
    description:
      "อนุรักษ์สิ่งแวดล้อม อนุรักษ์พลังงาน Green Living การออกแบบเพื่อสิ่งแวดล้อม ผลิตภัณฑ์รักษ์โลก เกษตรอินทรีย์",
  },
  {
    id: 29,
    name: "หอศิลป์",
    name_en: "art",
    slug: "art",
    is_pinned: false,
    imageUrl: "https://ptcdn.info/mobile/icon_room/pt-forum-art.svg",
    description: "ศิลปะ ภาพวาด ประวัติศาสตร์ศิลป์ สื่อประสม Graphic Design",
  },
  {
    id: 30,
    name: "การ์ตูน",
    name_en: "cartoon",
    slug: "cartoon",
    is_pinned: false,
    imageUrl: "https://ptcdn.info/mobile/icon_room/pt-forum-cartoon.svg",
    description:
      "การ์ตูนญี่ปุ่น การ์ตูนไทย การ์ตูนฝรั่ง อนิเมะ วาดการ์ตูน ของสะสมจากการ์ตูน คอสเพลย์",
  },
  {
    id: 35,
    name: "กรุงโซล",
    name_en: "korea",
    slug: "korea",
    is_pinned: false,
    imageUrl: "https://ptcdn.info/mobile/icon_room/pt-forum-korea.svg",
    description:
      "K-POP ซีรีส์เกาหลี นักแสดงเกาหลี อาหารเกาหลี เที่ยวเกาหลี แฟชั่นเกาหลี ภาษาเกาหลี",
  },
  {
    id: 36,
    name: "แก็ดเจ็ต",
    name_en: "gadget",
    slug: "gadget",
    is_pinned: false,
    imageUrl: "https://ptcdn.info/mobile/icon_room/pt-forum-gadget.svg",
    description:
      "Gadget, Action Camera, Drone, Game Console, Smartwatch, Smartband",
  },
];

export const HighlightList = [
  {
    text: "[Pantip Point] ชวนแชร์ภาพความสดชื่นต้อนรับ Summer! 🏖🌞",
    imageUrl:
      "https://ptcdn.info/home_highlight/2024-04/660a5393caac0a0cf70fbdb6_jd6ngnm8xv_400.png",
  },
  {
    text: "🎧 PANTIP PODCAST 🎧 3 อันดับกระทู้ฮิตบนพันทิปประจำวัน 📊",
    imageUrl:
      "https://ptcdn.info/home_highlight/2022-10/633b8e4a00d01f12500f33e6_hvzb60o1p0_400.jpg",
  },
  {
    text: "🚩 กิจกรรม “แนะวิธีคลายร้อน ต้อนรับซัมเมอร์สุดฮอต” 🏖 ตอบถูกใจทีมงานรับ Pantip point 50 คะแนน จำนวนรวม 15 รางวัล 🚩",
    imageUrl:
      "https://ptcdn.info/home_highlight/2024-04/660e2c43caac0acadf533594_2l8zr30w11_400.jpg",
  },
  {
    text: "Pantip Pick of the Year 2023 - รวม 10 สุดยอดกระทู้แห่งปี 2566 ที่ถูกใจทีมงาน Pantip",
    imageUrl:
      "https://ptcdn.info/home_highlight/2023-12/657823e0caac0aaaeb7ce7f6_t8aa9deoj4_400.png",
  },
  {
    text: "ข่าวดี! เพื่อนๆ สามารถสร้างรายได้ไปพร้อมกับใช้งาน Pantip ได้แล้วนะ",
    imageUrl:
      "https://ptcdn.info/home_highlight/2023-10/652e332fcaac0ae2e57cc04b_xb3qub3ed6_400.jpg",
  },
  {
    text: "พันทิปนานุกรม … ชวนมาดู Cover Design วันสำคัญ บนเว็บไซต์ Pantip",
    imageUrl:
      "https://ptcdn.info/home_highlight/2023-09/64f586c3caac0a43be1e9c04_ohwbqfbnf2_400.jpg",
  },
];

export const roomPostList = [
  {
    topic_id: 42627934,
    title:
      "ทำไมคนไทยที่อายุเยอะ ๆ หน่อยชอบบอกว่าเมืองไทยในอดีตอากาศไม่ร้อน (ทั้ง ๆ ที่โคตรร้อนเหมือนกัน)",

    created_time: "2024-04-06T09:00:26Z",
    thumbnail_url:
      "https://f.ptcdn.info/753/083/000/sbijkazula7ta0wHFA5p-s.png",
    views_count: 1230,
    comments_count: 139,
    votes_count: 4,
    author: {
      id: 6479057,
      name: "ไม่ชอบเรียนเคมี แต่หนีไม่พ้น",
    },
    tags: [
      {
        name: "พยากรณ์อากาศ",
        slug: "พยากรณ์อากาศ",
      },
      {
        name: "การเปลี่ยนแปลงสภาพภูมิอากาศ",
        slug: "การเปลี่ยนแปลงสภาพภูมิอากาศ",
      },
      {
        name: "ภูมิอากาศ",
        slug: "ภูมิอากาศ",
      },
      {
        name: "ภาวะโลกร้อน",
        slug: "ภาวะโลกร้อน",
      },
      {
        name: "ภูมิศาสตร์",
        slug: "ภูมิศาสตร์",
      },
    ],
    ranking_time: "2024-04-08T02:32:00.000Z",
    uid_ranking: 1,
  },
  {
    topic_id: 42621014,
    title:
      "แฟนให้เพื่อนผู้หญิงนั่งรถกลับต่างจังหวัดด้วยกันสองต่อสอง แต่เราไม่โอเคร เรางี่เง่าไปมั้ยคะ",
    topic_type: 3,
    created_time: "2024-04-03T05:27:47Z",
    views_count: 42357,
    comments_count: 170,
    votes_count: 1,
    author: {
      id: 8068463,
      name: "สมาชิกหมายเลข 8068463",
    },
    tags: [
      {
        name: "ประสบการณ์ความรัก",
        slug: "ประสบการณ์ความรัก",
      },
      {
        name: "ปัญหาความรัก",
        slug: "ปัญหาความรัก",
      },
      {
        name: "ประสบการณ์ชีวิตคู่",
        slug: "ประสบการณ์ชีวิตคู่",
      },
    ],
    ranking_time: "2024-04-08T02:32:00.000Z",
    uid_ranking: 2,
  },
  {
    topic_id: 42621548,
    title: "ตกงานในวัย 35 พร้อมกับมรดกก้อนหนึ่ง",
    topic_type: 3,
    created_time: "2024-04-03T10:05:17Z",
    views_count: 21104,
    comments_count: 138,
    votes_count: 1,
    author: {
      id: 781019,
      name: "สมาชิกหมายเลข 781019",
    },
    tags: [
      {
        name: "มนุษย์เงินเดือน",
        slug: "มนุษย์เงินเดือน",
      },
      {
        name: "เจ้าของธุรกิจ",
        slug: "เจ้าของธุรกิจ",
      },
      {
        name: "การเงิน",
        slug: "การเงิน",
      },
      {
        name: "พนักงานประจำ",
        slug: "พนักงานประจำ",
      },
      {
        name: "การวางแผนการเงิน",
        slug: "การวางแผนการเงิน",
      },
    ],
    ranking_time: "2024-04-08T02:32:00.000Z",
    uid_ranking: 3,
  },
  {
    topic_id: 42626774,
    title: "เปิดเหตุผล “ไก่ วรายุฑ ” ตัดใจขายอาณาจักรร้อยล้าน “วราวิลล์”",
    topic_type: 5,
    created_time: "2024-04-05T16:31:12Z",
    thumbnail_url:
      "https://f.ptcdn.info/747/083/000/sbh9rt1zqjuBGDqC1epsN-s.jpg",
    views_count: 2512,
    comments_count: 38,
    votes_count: 1,
    author: {
      id: 287767,
      name: "stardom",
    },
    tags: [
      {
        name: "วรายุฑ มิลินทจินดา (ไก่)",
        slug: "วรายุฑ_มิลินทจินดา_(ไก่)",
      },
      {
        name: "นักแสดง",
        slug: "นักแสดง",
      },
    ],
    ranking_time: "2024-04-08T02:32:00.000Z",
    uid_ranking: 4,
  },
  {
    topic_id: 42631086,
    title:
      "ได้แรงปาป้า Mojo ทุบ Fury 3-1 เกิดอะไรขึ้นกับฟอร์มสาวโมโจถึงได้ปังขึ้นเรื่อยๆคะ ?????",
    topic_type: 3,
    created_time: "2024-04-08T01:23:48Z",
    thumbnail_url:
      "https://f.ptcdn.info/724/083/000/sbd25a23gqrO9jXwUnAz3-s.gif",
    views_count: 0,
    comments_count: 15,
    votes_count: 0,
    author: {
      id: 188794,
      name: "The O.C.",
    },
    tags: [
      {
        name: "วอลเลย์บอล",
        slug: "วอลเลย์บอล",
      },
    ],
    ranking_time: "2024-04-08T02:32:00.000Z",
    uid_ranking: 5,
  },
  {
    topic_id: 42629060,
    title: 'ปัญหาเดิมๆเรื่องการใช้ "เลนจักรยาน"',
    topic_type: 3,
    created_time: "2024-04-06T23:52:35Z",
    thumbnail_url:
      "https://f.ptcdn.info/757/083/000/sbjnzx1ojhxbNB0s77WI1-s.jpg",
    views_count: 0,
    comments_count: 11,
    votes_count: 0,
    author: {
      id: 5310289,
      name: "สมาชิกหมายเลข 5310289",
    },
    tags: [
      {
        name: "จักรยาน",
        slug: "จักรยาน",
      },
      {
        name: "การพัฒนาสังคม (Social Development)",
        slug: "การพัฒนาสังคม_(Social_Development)",
      },
      {
        name: "เส้นทางจักรยาน",
        slug: "เส้นทางจักรยาน",
      },
      {
        name: "อุบัติเหตุบนท้องถนน",
        slug: "อุบัติเหตุบนท้องถนน",
      },
      {
        name: "การป้องกันอุบัติเหตุ",
        slug: "การป้องกันอุบัติเหตุ",
      },
    ],
    ranking_time: "2024-04-08T02:32:00.000Z",
    uid_ranking: 6,
  },
  {
    topic_id: 42622019,
    title: "ทำไมแกงไตปลาถึงกลายเป็นอาหารยอดแย่อันดับ 1 ของโลก",
    topic_type: 3,
    created_time: "2024-04-03T14:19:50Z",
    thumbnail_url:
      "https://f.ptcdn.info/726/083/000/sbdef31etrtcqbzANGijy-s.jpg",
    views_count: 1024,
    comments_count: 68,
    votes_count: 0,
    author: {
      id: 599190,
      name: "Honeymile",
    },
    tags: [
      {
        name: "อาหาร",
        slug: "อาหาร",
      },
      {
        name: "อาหารภาคใต้",
        slug: "อาหารภาคใต้",
      },
      {
        name: "หน้าต่างโลก",
        slug: "หน้าต่างโลก",
      },
      {
        name: "สังคมชาวพันทิป",
        slug: "สังคมชาวพันทิป",
      },
      {
        name: "อาหารไทย",
        slug: "อาหารไทย",
      },
    ],
    ranking_time: "2024-04-08T02:32:00.000Z",
    uid_ranking: 7,
  },

  {
    topic_id: 42631057,
    title: "งง อยู่นะเข้าแคมป์ปีนี้",
    topic_type: 1,
    created_time: "2024-04-08T00:44:05Z",
    views_count: 0,
    comments_count: 8,
    votes_count: 0,
    author: {
      id: 7171311,
      name: "สมาชิกหมายเลข 7171311",
    },
    tags: [
      {
        name: "วอลเลย์บอล",
        slug: "วอลเลย์บอล",
      },
      {
        name: "วอลเลย์บอลไทย",
        slug: "วอลเลย์บอลไทย",
      },
    ],
    ranking_time: "2024-04-08T02:32:00.000Z",
    uid_ranking: 9,
  },
  {
    topic_id: 42631132,
    title: "BABYMONSTER จะปรากฏตัวในรายการ It’s live",
    topic_type: 1,
    created_time: "2024-04-08T02:12:29Z",
    thumbnail_url:
      "https://f.ptcdn.info/768/083/000/sblq3u19ncy8F8QMckpOa-s.jpg",
    views_count: 0,
    comments_count: 5,
    votes_count: 0,
    author: {
      id: 6890503,
      name: "สมาชิกหมายเลข 6890503",
    },
    tags: [
      {
        name: "BABYMONSTER (นักร้องนักดนตรี)",
        slug: "BABYMONSTER_(นักร้องนักดนตรี)",
      },
      {
        name: "K-POP",
        slug: "K-POP",
      },
      {
        name: "YG Entertainment",
        slug: "YG_Entertainment",
      },
    ],
    ranking_time: "2024-04-08T02:32:00.000Z",
    uid_ranking: 10,
  },
  {
    topic_id: 42629906,
    title:
      "ใครจะคว้ารางวัลนักแสดงจากนาฏราช ครั้งที่ 15 ไปครอง ร่วมลุ้นร่วมเชียร์ใครกันบ้างคะ",
    topic_type: 3,
    created_time: "2024-04-07T09:53:29Z",
    thumbnail_url:
      "https://f.ptcdn.info/761/083/000/sbkgs81hyz3axZU32TdA1-s.jpg",
    views_count: 0,
    comments_count: 7,
    votes_count: 0,
    author: {
      id: 6506073,
      name: "ตราบฟ้าตะวันลับ",
    },
    tags: [
      {
        name: "7 HD",
        slug: "7_HD",
      },
      {
        name: "3 HD (BEC)",
        slug: "3_HD_(BEC)",
      },
      {
        name: "One31",
        slug: "One31",
      },
      {
        name: "ละครโทรทัศน์",
        slug: "ละครโทรทัศน์",
      },
      {
        name: "รางวัลนาฏราช",
        slug: "รางวัลนาฏราช",
      },
    ],
    ranking_time: "2024-04-08T02:32:00.000Z",
    uid_ranking: 12,
  },
  {
    topic_id: 42610767,
    title: "สาธุ  [Netflix]   สปอยคุยกันหลังดูจบครับ",
    topic_type: 3,
    created_time: "2024-03-29T08:13:18Z",
    views_count: 70060,
    comments_count: 40,
    votes_count: 0,
    author: {
      id: 2326138,
      name: "สมาชิกหมายเลข 2326138",
    },
    tags: [
      {
        name: "Netflix",
        slug: "Netflix",
      },
      {
        name: "สาธุ (ซีรีส์ไทย)",
        slug: "สาธุ_(ซีรีส์ไทย)",
      },
    ],
    ranking_time: "2024-04-08T02:32:00.000Z",
    uid_ranking: 13,
  },
  {
    topic_id: 42627343,
    title: "มาแล้ว มาแล้ว มาแล้ว กับสลากออมทรัพย์ ชุด นาคราช🐉🐉🐉จาก ธอส",
    topic_type: 3,
    created_time: "2024-04-06T03:07:27Z",
    thumbnail_url:
      "https://f.ptcdn.info/750/083/000/sbi31o2dzd5wR12n92C8c-s.jpg",
    views_count: 443,
    comments_count: 30,
    votes_count: 4,
    author: {
      id: 5918554,
      name: "สมาชิกหมายเลข 5918554",
    },
    tags: [
      {
        name: "การออมเงิน",
        slug: "การออมเงิน",
      },
      {
        name: "การเงิน",
        slug: "การเงิน",
      },
      {
        name: "ธนาคารอาคารสงเคราะห์",
        slug: "ธนาคารอาคารสงเคราะห์",
      },
      {
        name: "การลงทุน",
        slug: "การลงทุน",
      },
    ],
    ranking_time: "2024-04-08T02:32:00.000Z",
    uid_ranking: 16,
  },
  {
    topic_id: 42627229,
    title: "หมั้นกันแล้ว ฝ่ายชายควรให้เงินเราใช้มั้ยคะ",
    topic_type: 3,
    created_time: "2024-04-06T01:16:31Z",
    views_count: 1388,
    comments_count: 71,
    votes_count: 0,
    author: {
      id: 5987466,
      name: "สมาชิกหมายเลข 5987466",
    },
    tags: [
      {
        name: "พิธีหมั้น",
        slug: "พิธีหมั้น",
      },
      {
        name: "ประสบการณ์ชีวิตคู่",
        slug: "ประสบการณ์ชีวิตคู่",
      },
      {
        name: "ประสบการณ์ความรัก",
        slug: "ประสบการณ์ความรัก",
      },
      {
        name: "พิธีสู่ขอ",
        slug: "พิธีสู่ขอ",
      },
    ],
    ranking_time: "2024-04-08T02:32:00.000Z",
    uid_ranking: 17,
  },
  {
    topic_id: 42631026,
    title:
      "“ณวัฒน์” ลั่นเวทีเราหาเงิน มิสแกรนด์ปีนี้จิ้ม “หลิน” เพราะสปอนฯ หนัก",
    topic_type: 5,
    created_time: "2024-04-07T23:56:53Z",
    views_count: 0,
    comments_count: 3,
    votes_count: 0,
    author: {
      id: 309860,
      name: "parn 256",
    },
    tags: [
      {
        name: "การลงทุน",
        slug: "การลงทุน",
      },
      {
        name: "หุ้น",
        slug: "หุ้น",
      },
      {
        name: "Miss Grand Thailand",
        slug: "Miss_Grand_Thailand",
      },
    ],
    ranking_time: "2024-04-08T02:32:00.000Z",
    uid_ranking: 18,
  },
  {
    topic_id: 42630507,
    title: "หลังจากดูbaby monsterในอินกิกาโยไงละ",
    topic_type: 1,
    created_time: "2024-04-07T15:12:54Z",
    views_count: 0,
    comments_count: 23,
    votes_count: 0,
    author: {
      id: 2403836,
      name: "สมาชิกหมายเลข 2403836",
      avatar: {
        original:
          "https://p.ptcdn.info/240/013/000/2403836_16122371520642_o.jpg",
        large: "https://p.ptcdn.info/240/013/000/2403836_16122371520642_l.jpg",
        medium: "https://p.ptcdn.info/240/013/000/2403836_16122371520642_m.jpg",
        small: "https://p.ptcdn.info/240/013/000/2403836_16122371520642_s.jpg",
      },
      slug: "/profile/2403836",
    },
    tags: [
      {
        name: "K-POP",
        slug: "K-POP",
      },
      {
        name: "YG Entertainment",
        slug: "YG_Entertainment",
      },
      {
        name: "BABYMONSTER (นักร้องนักดนตรี)",
        slug: "BABYMONSTER_(นักร้องนักดนตรี)",
      },
    ],
    ranking_time: "2024-04-08T02:32:00.000Z",
    uid_ranking: 19,
  },
  {
    topic_id: 42630294,
    title:
      "[#แปลความเห็น] ความเห็นเนติเซ็นต่อสเตจเดบิวต์ของ “chiquita” และ “pharita”",
    topic_type: 3,
    created_time: "2024-04-07T13:29:30Z",
    views_count: 0,
    comments_count: 9,
    votes_count: 6,
    author: {
      id: 7031239,
      name: "สมาชิกหมายเลข 7031239",
    },
    tags: [
      {
        name: "K-POP",
        slug: "K-POP",
      },
      {
        name: "BABYMONSTER (นักร้องนักดนตรี)",
        slug: "BABYMONSTER_(นักร้องนักดนตรี)",
      },
    ],
    ranking_time: "2024-04-08T02:32:00.000Z",
    uid_ranking: 21,
  },
  {
    topic_id: 42627493,
    title:
      "จาจังมยอน  จาจังมยอน   เหมือนถูกสะกดจิตจากซีรีส์เกาหลี  ได้ยินแทบทุกครั้งที่ดู  เอาหน่อย  ลองไปกินดู  แล้วพบว่า",
    topic_type: 1,
    created_time: "2024-04-06T04:37:17Z",
    thumbnail_url:
      "https://f.ptcdn.info/751/083/000/sbi6im16do3AnrIL159dI-s.jpg",
    views_count: 877,
    comments_count: 37,
    votes_count: 4,
    author: {
      id: 1078823,
      name: "กัมบอล",
    },
    tags: [
      {
        name: "อาหารนานาชาติ",
        slug: "อาหารนานาชาติ",
      },
      {
        name: "เมนูเส้น",
        slug: "เมนูเส้น",
      },
      {
        name: "อาหารเกาหลี",
        slug: "อาหารเกาหลี",
      },
    ],
    ranking_time: "2024-04-08T02:32:00.000Z",
    uid_ranking: 22,
  },
  {
    topic_id: 42630997,
    title:
      "HITACHI Sign contract กับแนนยังไงเหรอ น่าจะลากไปถึง วีคัพ ให้สิ้นสุด",
    topic_type: 3,
    created_time: "2024-04-07T23:16:19Z",
    views_count: 0,
    comments_count: 2,
    votes_count: 0,
    author: {
      id: 7985411,
      name: "สมาชิกหมายเลข 7985411",
    },
    tags: [
      {
        name: "วอลเลย์บอล",
        slug: "วอลเลย์บอล",
      },
      {
        name: "ทัดดาว นึกแจ้ง",
        slug: "ทัดดาว_นึกแจ้ง",
      },
      {
        name: "V.League (Japan Volleyball League)",
        slug: "V.League_(Japan_Volleyball_League)",
      },
      {
        name: "วอลเลย์บอลต่างประเทศ",
        slug: "วอลเลย์บอลต่างประเทศ",
      },
      {
        name: "นักวอลเลย์บอล",
        slug: "นักวอลเลย์บอล",
      },
    ],
    ranking_time: "2024-04-08T02:32:00.000Z",
    uid_ranking: 24,
  },
];

export const HiztLizt = [
  {
    topic_id: 42631102,
    title:
      "ทัวร์0เหรียญจีน ทำลายไทย หลอกคนจีน มาต้มตุ๋นที่ไทย เงินกลับจีนหมด ไทยไม่ได้อะไรเลย",
    topic_type: 1,
    created_time: "2024-04-08T01:41:02Z",
    views_count: 0,
    comments_count: 4,
    votes_count: 0,
    author: {
      id: 310059,
      name: "ฮก ฮก",
    },
    tags: [
      {
        name: "เที่ยวไทย",
        slug: "เที่ยวไทย",
      },
      {
        name: "เศรษฐกิจ",
        slug: "เศรษฐกิจ",
      },
      {
        name: "การเงิน",
        slug: "การเงิน",
      },
      {
        name: "การตลาด",
        slug: "การตลาด",
      },
    ],
    timestamp: "1712542923856",
  },
  {
    topic_id: 42631086,
    title:
      "ได้แรงปาป้า Mojo ทุบ Fury 3-1 เกิดอะไรขึ้นกับฟอร์มสาวโมโจถึงได้ปังขึ้นเรื่อยๆคะ ?????",
    topic_type: 3,
    created_time: "2024-04-08T01:23:48Z",
    thumbnail_url:
      "https://f.ptcdn.info/724/083/000/sbd25a23gqrO9jXwUnAz3-s.gif",
    views_count: 0,
    comments_count: 15,
    votes_count: 0,
    author: {
      id: 188794,
      name: "The O.C.",
    },
    tags: [
      {
        name: "วอลเลย์บอล",
        slug: "วอลเลย์บอล",
      },
    ],
    timestamp: "1712542324547",
  },
  {
    topic_id: 42631046,
    title:
      "จ่ายภาษีด้วยบัตรเครดิต แบบผ่อน  0%  เพิ่มจากที่แบ่งจ่าย3 งวด จาก กรมสรรพากร ได้ไหมครับ",
    topic_type: 3,
    created_time: "2024-04-08T00:31:53Z",
    views_count: 0,
    comments_count: 3,
    votes_count: 0,
    author: {
      id: 292004,
      name: "gosurachai",
    },
    tags: [
      {
        name: "ภาษีเงินได้บุคคลธรรมดา",
        slug: "ภาษีเงินได้บุคคลธรรมดา",
      },
      {
        name: "กรมสรรพากร",
        slug: "กรมสรรพากร",
      },
      {
        name: "บัตรเครดิต",
        slug: "บัตรเครดิต",
      },
    ],
    timestamp: "1712541724215",
  },
  {
    topic_id: 42630965,
    title:
      '“ลออจันทร์”  ตอนนี้ เดินทางมาถึงตอนจบแล้ว  เพื่อนๆ คิดว่า  "ผ่าน"  หรือไม่  ให้กี่คะแนนดี',
    topic_type: 3,
    created_time: "2024-04-07T22:08:47Z",
    thumbnail_url:
      "https://f.ptcdn.info/656/083/000/sb0uf41jx1jS3Th48DeWs-s.jpg",
    views_count: 0,
    comments_count: 5,
    votes_count: 0,
    author: {
      id: 4962221,
      name: "สมาชิกหมายเลข 4962221",
    },
    tags: [
      {
        name: "3 HD (BEC)",
        slug: "3_HD_(BEC)",
      },
      {
        name: "BEC (ช่อง 3)",
        slug: "BEC_(ช่อง_3)",
      },
      {
        name: "ดวงใจเทวพรหม",
        slug: "ดวงใจเทวพรหม",
      },
      {
        name: "ดวงใจเทวพรหม (ละคร)",
        slug: "ดวงใจเทวพรหม_(ละคร)",
      },
      {
        name: "ลออจันทร์ (ดวงใจเทวพรหม)",
        slug: "ลออจันทร์_(ดวงใจเทวพรหม)",
      },
    ],
    timestamp: "1712541124139",
  },
  {
    topic_id: 42631028,
    title: "240408 - LALISA DAILY NEWS 👑 🌏  #LLOUD @weareLLoud",
    topic_type: 5,
    created_time: "2024-04-07T23:57:04Z",
    thumbnail_url:
      "https://f.ptcdn.info/767/083/000/sblloqa9hzs5Y33kgrUw-s.jpg",
    views_count: 0,
    comments_count: 12,
    votes_count: 0,
    author: {
      id: 4021474,
      name: "LisaCool",
    },
    tags: [
      {
        name: "ลลิษา มโนบาล (ลลิส)",
        slug: "ลลิษา_มโนบาล_(ลลิส)",
      },
      {
        name: "LLOUD (ค่ายเพลง)",
        slug: "LLOUD_(ค่ายเพลง)",
      },
      {
        name: "K-POP",
        slug: "K-POP",
      },
      {
        name: "BLACKPINK (นักร้องนักดนตรี)",
        slug: "BLACKPINK_(นักร้องนักดนตรี)",
      },
    ],
    timestamp: "1712540524109",
  },
  {
    topic_id: 42631026,
    title:
      "“ณวัฒน์” ลั่นเวทีเราหาเงิน มิสแกรนด์ปีนี้จิ้ม “หลิน” เพราะสปอนฯ หนัก",
    topic_type: 5,
    created_time: "2024-04-07T23:56:53Z",
    views_count: 0,
    comments_count: 3,
    votes_count: 0,
    author: {
      id: 309860,
      name: "parn 256",
    },
    tags: [
      {
        name: "การลงทุน",
        slug: "การลงทุน",
      },
      {
        name: "หุ้น",
        slug: "หุ้น",
      },
      {
        name: "Miss Grand Thailand",
        slug: "Miss_Grand_Thailand",
      },
    ],
    timestamp: "1712539924133",
  },
  {
    topic_id: 42630801,
    title:
      "🔴 LIVE | San Diego MOJO VS Columbus FURY | Pro Volleyball Federation | 08/04/24 06.00 น",
    topic_type: 1,
    created_time: "2024-04-07T18:13:54Z",
    thumbnail_url:
      "https://f.ptcdn.info/716/083/000/sbbk4mwt3fCV46e916Pq-s.png",
    views_count: 0,
    comments_count: 51,
    votes_count: 0,
    author: {
      id: 3673074,
      name: "สมาชิกหมายเลข 3673074",
    },
    tags: [
      {
        name: "วอลเลย์บอล",
        slug: "วอลเลย์บอล",
      },
      {
        name: "นุศรา ต้อมคำ",
        slug: "นุศรา_ต้อมคำ",
      },
      {
        name: "วอลเลย์บอลต่างประเทศ",
        slug: "วอลเลย์บอลต่างประเทศ",
      },
      {
        name: "สโมสรวอลเลย์บอลต่างประเทศ",
        slug: "สโมสรวอลเลย์บอลต่างประเทศ",
      },
    ],
    timestamp: "1712538724072",
  },
  {
    topic_id: 42631030,
    title: "ญ ที่หาคู่ตอนแก่ ทำไมคนมองไม่ดี",
    topic_type: 3,
    created_time: "2024-04-07T23:58:05Z",
    views_count: 0,
    comments_count: 17,
    votes_count: 0,
    author: {
      id: 8061754,
      name: "สมาชิกหมายเลข 8061754",
    },
    tags: [
      {
        name: "ประสบการณ์ชีวิตคู่",
        slug: "ประสบการณ์ชีวิตคู่",
      },
    ],
    timestamp: "1712538124713",
  },
  {
    topic_id: 42630651,
    title: "เจมส์จิตอนปรากฎตัวคุณชายพุฒิภัทรความดังระดับไหน",
    topic_type: 3,
    created_time: "2024-04-07T16:42:49Z",
    views_count: 0,
    comments_count: 14,
    votes_count: 0,
    author: {
      id: 7477321,
      name: "สมาชิกหมายเลข 7477321",
    },
    tags: [
      {
        name: "จิรายุ ตั้งศรีสุข (เจมส์)",
        slug: "จิรายุ_ตั้งศรีสุข_(เจมส์)",
      },
      {
        name: "คุณชายพุฒิภัทร (สุภาพบุรุษจุฑาเทพ)",
        slug: "คุณชายพุฒิภัทร_(สุภาพบุรุษจุฑาเทพ)",
      },
      {
        name: "3 HD (BEC)",
        slug: "3_HD_(BEC)",
      },
    ],
    timestamp: "1712537524337",
  },
  {
    topic_id: 42630735,
    title: "มีข่าวลือว่า JENNIE x GENTLE MONSTER จะมาปลายเดือนนี้ 👀",
    topic_type: 1,
    created_time: "2024-04-07T17:21:56Z",
    thumbnail_url:
      "https://f.ptcdn.info/765/083/000/sbl0kf228t0XVXiS2pNJ7-o.jpg",
    views_count: 0,
    comments_count: 6,
    votes_count: 0,
    author: {
      id: 3455581,
      name: "Paint it Black",
    },
    tags: [
      {
        name: "KIM JENNIE (นักร้องนักดนตรี)",
        slug: "KIM_JENNIE_(นักร้องนักดนตรี)",
      },
      {
        name: "ODD ATELIER (ค่ายเพลงเกาหลี)",
        slug: "ODD_ATELIER_(ค่ายเพลงเกาหลี)",
      },
      {
        name: "BLACKPINK (นักร้องนักดนตรี)",
        slug: "BLACKPINK_(นักร้องนักดนตรี)",
      },
      {
        name: "K-POP",
        slug: "K-POP",
      },
    ],
    timestamp: "1712536923973",
  },
];

export const FooterMenu = [
  [
    {
      title: "หน้าแรก",
      link: "/",
    },
    {
      title: "My feed",
      link: "/",
    },
    {
      title: "Pantip Pick",
      link: "/",
    },
    {
      title: "Pantip Hitz",
      link: "/",
    },
    {
      title: "Explore",
      link: "/",
    },
  ],

  [
    {
      title: "แลกพอยท์",
      link: "/",
    },
    {
      title: "กิจกรรมพันทิป",
      link: "/",
    },
  ],

  [
    {
      title: " กฎ กติกาและมารยาท",
      link: "/",
    },
    {
      title: "คำแนะนำการโพสต์",
      link: "/",
    },
    {
      title: "นโยบายความเป็นส่วนตัว",
      link: "/",
    },
    {
      title: "สิทธิ์การใช้งานของสมาชิก",
      link: "/",
    },
    {
      title: "ติดต่อทีมงาน",
      link: "/",
    },
    {
      title: "ติดต่อลงโฆษณา",
      link: "/",
    },
    {
      title: "ร่วมงานกับ pantip",
      link: "/",
    },
    {
      title: "Download App Pantip",
      link: "/",
    },
    {
      title: "Pantip Certified Developer",
      link: "/",
    },
  ],
];

export const socialMedia = [
  {
    icon: FaFacebook,
    link: "https://www.facebook.com",
  },
  {
    icon: FaInstagram,
    link: "https://www.instagram.com",
  },
  {
    icon: FaTwitter,
    link: "https://www.twitter.com",
  },
  {
    icon: FaYoutube,
    link: "https://www.youtube.com",
  },
];

export const foodPost = [
  {
    topic_id: 42631941,
    title: "7-11 delivery",
    topic_type: 3,
    created_time: "2024-04-08T09:34:13Z",
    views_count: 0,
    comments_count: 3,
    votes_count: 0,
    author: {
      id: 7914450,
      name: "สมาชิกหมายเลข 7914450",
    },
    tags: [
      { name: "อาหารเดลิเวอรี", slug: "อาหารเดลิเวอรี" },
      { name: "7-Eleven", slug: "7-Eleven" },
    ],
  },
  {
    topic_id: 42631915,
    title: "ราเมน ซุปกลมกล่อม ดับร้อน!",
    topic_type: 4,
    created_time: "2024-04-08T09:23:14Z",
    thumbnail_url:
      "https://f.ptcdn.info/772/083/000/sbma1e21wxldnU5W64iFP-s.jpg",
    views_count: 0,
    comments_count: 5,
    votes_count: 1,
    author: {
      id: 7778472,
      name: "สมาชิกหมายเลข 7778472",
    },
    is_cr: true,
    is_sr: false,
    is_br: false,
    tags: [{ name: "อาหารญี่ปุ่น", slug: "อาหารญี่ปุ่น" }],
  },
  {
    topic_id: 42631877,
    title: "โรงแรม อารีน่ารีสอร์ท (จ.อุตรดิตถ์)",
    topic_type: 4,
    created_time: "2024-04-08T09:04:06Z",
    thumbnail_url:
      "https://f.ptcdn.info/772/083/000/sbm8et1nm4njFfGk0Dn3I-s.png",
    views_count: 0,
    comments_count: 5,
    votes_count: 1,
    author: {
      id: 8016770,
      name: "สมาชิกหมายเลข 8016770",
    },
    is_cr: false,
    is_sr: true,
    is_br: false,
    tags: [
      { name: "โรงแรมรีสอร์ท", slug: "โรงแรมรีสอร์ท" },
      { name: "จังหวัดอุตรดิตถ์", slug: "จังหวัดอุตรดิตถ์" },
      { name: "อาหาร", slug: "อาหาร" },
    ],
  },
  {
    topic_id: 42631864,
    title:
      'รีวิว "Fufu Shabu" บุฟเฟ่ต์หม้อไฟตำรับไต้หวันวัตถุดิบคุณภาพดีกว่า 150 เมนู/ไอศครีมพรีเมียมไม่อั้น เริ่มต้นแค่คนละ 688 บ.',
    topic_type: 4,
    created_time: "2024-04-08T08:57:15Z",
    thumbnail_url:
      "https://f.ptcdn.info/771/083/000/sbm82aso9d1HUJ6AoL59-s.jpg",
    views_count: 0,
    comments_count: 5,
    votes_count: 3,
    author: {
      id: 4865251,
      name: "Food Addicts",
    },
    is_cr: true,
    is_sr: false,
    is_br: false,
    tags: [
      { name: "อาหารคาว", slug: "อาหารคาว" },
      { name: "อาหารบุฟเฟ่ต์", slug: "อาหารบุฟเฟ่ต์" },
      { name: "อาหารจีน", slug: "อาหารจีน" },
      { name: "อาหารซีฟู้ด", slug: "อาหารซีฟู้ด" },
      { name: "ชาบู/สุกี้ยากี้", slug: "ชาบู/สุกี้ยากี้" },
    ],
  },
  {
    topic_id: 42631861,
    title:
      "เซ็ง… โดน พนง.ฟูจิ บอกให้กินถึงสามหมื่น ก่อนสิ้นเดือน ก.ค.ปีก่อน เพื่อรักษาสิทธิ์ส่วนลด แต่สุดท้าย ไม่ได้ตามนั้น",
    topic_type: 1,
    created_time: "2024-04-08T08:56:24Z",
    thumbnail_url:
      "https://f.ptcdn.info/772/083/000/sbm8sf20dfa8sqHoHukBJ-s.jpg",
    views_count: 0,
    comments_count: 2,
    votes_count: 0,
    author: {
      id: 384930,
      name: "Tenma_21",
    },
    tags: [
      { name: "คุ้มครองผู้บริโภค", slug: "คุ้มครองผู้บริโภค" },
      { name: "ร้านอาหาร", slug: "ร้านอาหาร" },
    ],
  },
  {
    topic_id: 42631850,
    title: "อาหารยอดแย่ เป็นปัจจัยทางวัฒนธรรม",
    topic_type: 3,
    created_time: "2024-04-08T08:50:48Z",
    views_count: 0,
    comments_count: 3,
    votes_count: 0,
    author: {
      id: 2694472,
      name: "สมาชิกหมายเลข 2694472",
    },
    tags: [
      { name: "อาหารภาคใต้", slug: "อาหารภาคใต้" },
      { name: "วัฒนธรรมต่างชาติ", slug: "วัฒนธรรมต่างชาติ" },
    ],
  },
  {
    topic_id: 42631812,
    title: "ร้อนๆแบบนี้ทำเมนูอะไรทานดี",
    topic_type: 3,
    created_time: "2024-04-08T08:28:57Z",
    views_count: 0,
    comments_count: 8,
    votes_count: 0,
    author: {
      id: 8060414,
      name: "สมาชิกหมายเลข 8060414",
    },
    tags: [
      { name: "ทำอาหาร", slug: "ทำอาหาร" },
      { name: "อาหารไทย", slug: "อาหารไทย" },
      { name: "ร้านอาหาร", slug: "ร้านอาหาร" },
      { name: "เมนูอาหาร", slug: "เมนูอาหาร" },
      { name: "เคล็ดลับก้นครัว", slug: "เคล็ดลับก้นครัว" },
    ],
  },
  {
    topic_id: 42631789,
    title: "แกงจืดหมูห่มผักกาด",
    topic_type: 1,
    created_time: "2024-04-08T08:15:57Z",
    thumbnail_url:
      "https://f.ptcdn.info/771/083/000/sbm5961jsdvhmvi77v7KR-s.jpg",
    views_count: 0,
    comments_count: 7,
    votes_count: 2,
    author: {
      id: 2237109,
      name: "เจ๊แก้ว คนเก่ง",
    },
    tags: [
      { name: "เมนูต้ม", slug: "เมนูต้ม" },
      { name: "ทำอาหาร", slug: "ทำอาหาร" },
      { name: "อาหารคาว", slug: "อาหารคาว" },
    ],
  },
  {
    topic_id: 42631717,
    title: "ผ่าตัดไส้ติ่งสามารกินเครปได้ไหม",
    topic_type: 3,
    created_time: "2024-04-08T07:44:35Z",
    views_count: 0,
    comments_count: 3,
    votes_count: 0,
    author: {
      id: 7858261,
      name: "สมาชิกหมายเลข 7858261",
    },
    tags: [
      { name: "โภชนาการ", slug: "โภชนาการ" },
      { name: "ขนม", slug: "ขนม" },
    ],
  },
  {
    topic_id: 42631710,
    title: "ทำไมทานกาแฟ แล้วไม่ค่อยหิวข้าวคะ",
    topic_type: 1,
    created_time: "2024-04-08T07:42:18Z",
    views_count: 0,
    comments_count: 5,
    votes_count: 0,
    author: {
      id: 7978428,
      name: "สมาชิกหมายเลข 7978428",
    },
    tags: [
      { name: "กาแฟ", slug: "กาแฟ" },
      { name: "ร้านกาแฟ", slug: "ร้านกาแฟ" },
      { name: "ระบบร่างกาย", slug: "ระบบร่างกาย" },
      { name: "ปัญหาชีวิต", slug: "ปัญหาชีวิต" },
    ],
  },
  {
    topic_id: 42631703,
    title: "รีวิว...บางแสนหมื่นแคล ไม่ค่อยเที่ยวแต่กินไม่หยุด",
    topic_type: 4,
    created_time: "2024-04-08T07:40:26Z",
    thumbnail_url:
      "https://f.ptcdn.info/770/083/000/sbm2cn1ef5680XdUXkD9Z-s.jpg",
    views_count: 0,
    comments_count: 18,
    votes_count: 1,
    author: {
      id: 315239,
      name: "วิวริมหน้าต่าง",
    },
    is_cr: true,
    is_sr: false,
    is_br: false,
    tags: [
      { name: "บันทึกนักเดินทาง", slug: "บันทึกนักเดินทาง" },
      { name: "เที่ยวไทย", slug: "เที่ยวไทย" },
      { name: "อาหาร", slug: "อาหาร" },
      { name: "ภาพถ่าย", slug: "ภาพถ่าย" },
      { name: "ร้านอาหาร", slug: "ร้านอาหาร" },
    ],
  },
  {
    topic_id: 42631689,
    title: "วันเกิด~ร้านอาหาร+โปรวันเกิดดีๆ",
    topic_type: 3,
    created_time: "2024-04-08T07:30:59Z",
    views_count: 0,
    comments_count: 0,
    votes_count: 0,
    author: {
      id: 7880574,
      name: "สมาชิกหมายเลข 7880574",
    },
    tags: [
      { name: "ร้านอาหาร", slug: "ร้านอาหาร" },
      { name: "จังหวัดนนทบุรี", slug: "จังหวัดนนทบุรี" },
    ],
  },
  {
    topic_id: 42631684,
    title:
      "เที่ยววัดมณีวงศ์ ชมวังพญานาค วิจิตรตระการตา แล้วแวะภูตะลึง คาเฟ่สุดอลังการ ในจ.นครนายก",
    topic_type: 1,
    created_time: "2024-04-08T07:25:31Z",
    thumbnail_url:
      "https://f.ptcdn.info/770/083/000/sbm3191e7izYcTCP4a5Oi-s.jpg",
    views_count: 0,
    comments_count: 7,
    votes_count: 0,
    author: {
      id: 1831260,
      name: "เที่ยวสบายสบาย",
    },
    tags: [
      { name: "เที่ยววัด", slug: "เที่ยววัด" },
      { name: "เที่ยวนครนายก", slug: "เที่ยวนครนายก" },
      { name: "จังหวัดนครนายก", slug: "จังหวัดนครนายก" },
      { name: "คาเฟ่ (Cafe)", slug: "คาเฟ่_(Cafe)" },
      { name: "ร้านอาหาร", slug: "ร้านอาหาร" },
    ],
  },
];
export const isolatedPost = [
  {
    topic_id: 42632097,
    title: "บริษัทแฟลชสามารถออกเลขพัสดุทั้งที่ไม่ได้รับพัสดุได้ไหมครับ",
    topic_type: 3,
    created_time: "2024-04-08T10:57:16Z",
    views_count: 0,
    comments_count: 0,
    votes_count: 0,
    author: {
      id: 8069877,
      name: "สมาชิกหมายเลข 8069877",
    },
    tags: [{ name: "Flash Express", slug: "Flash_Express" }],
  },
  {
    topic_id: 42632095,
    title: "อยากสอบถามเรื่องเข้ารับพัสดุเองของj\u0026t",
    topic_type: 3,
    created_time: "2024-04-08T10:57:02Z",
    thumbnail_url:
      "https://f.ptcdn.info/773/083/000/sbmee6yfu2iG2EkrxN8T-s.jpg",
    views_count: 0,
    comments_count: 0,
    votes_count: 0,
    author: {
      id: 7840920,
      name: "สมาชิกหมายเลข 7840920",
    },
    tags: [{ name: "J\u0026T Express", slug: "J\u0026T_Express" }],
  },
  {
    topic_id: 42632079,
    title: "รุ่น4 ใครที่น่าจับตามองที่สุด",
    topic_type: 1,
    created_time: "2024-04-08T10:52:05Z",
    views_count: 0,
    comments_count: 0,
    votes_count: 0,
    author: {
      id: 7154521,
      name: "สมาชิกหมายเลข 7154521",
    },
    tags: [{ name: "BNK48", slug: "BNK48" }],
  },
  {
    topic_id: 42632073,
    title: "อยากขายช่องtiktokผู้ติดตาม 48.8k ขายได้เท่าไหร่",
    topic_type: 3,
    created_time: "2024-04-08T10:47:33Z",
    views_count: 0,
    comments_count: 0,
    votes_count: 0,
    author: {
      id: 6495952,
      name: "สมาชิกหมายเลข 6495952",
    },
    tags: [{ name: "TikTok", slug: "TikTok" }],
  },
  {
    topic_id: 42632050,
    title:
      "ถ้ามีหมายศาลเรียกมาแต่เรื่องจบไปแล้วไม่ได้ขึ้นศาลเราจะติดประวัติติดตัวไหมครับ",
    topic_type: 3,
    created_time: "2024-04-08T10:35:28Z",
    views_count: 0,
    comments_count: 0,
    votes_count: 0,
    author: {
      id: 8009944,
      name: "สมาชิกหมายเลข 8009944",
    },
    tags: [
      { name: "ศาลจังหวัด", slug: "ศาลจังหวัด" },
      { name: "คดีแพ่ง", slug: "คดีแพ่ง" },
      { name: "ศาลแพ่ง", slug: "ศาลแพ่ง" },
      { name: "ศาลอาญา", slug: "ศาลอาญา" },
    ],
  },
  {
    topic_id: 42632045,
    title: "คนเกิดกลางวันกลางคืนที่เลยเที่ยงคืนแล้วนับยังไง",
    topic_type: 3,
    created_time: "2024-04-08T10:34:11Z",
    views_count: 0,
    comments_count: 1,
    votes_count: 0,
    author: {
      id: 8077208,
      name: "สมาชิกหมายเลข 8077208",
    },
    tags: [
      {
        name: "เจนนี่ กลางวันครับ กลางคืนค่ะ (ซีรีส์)",
        slug: "เจนนี่_กลางวันครับ_กลางคืนค่ะ_(ซีรีส์)",
      },
    ],
  },
  {
    topic_id: 42632043,
    title: "สอบถามหน่อยครับพอดีShopee เขาโทรมาอันนี้จิงมั้ยครับ",
    topic_type: 3,
    created_time: "2024-04-08T10:32:44Z",
    thumbnail_url: "https://f.ptcdn.info/772/083/000/sbmd8zmv7bC1kCBj32q-s.png",
    views_count: 0,
    comments_count: 1,
    votes_count: 0,
    author: {
      id: 8077221,
      name: "สมาชิกหมายเลข 8077221",
    },
    tags: [{ name: "Shopee", slug: "Shopee" }],
  },
  {
    topic_id: 42632037,
    title: "ถามเรื่องการทำโรงงานสายไฟ",
    topic_type: 3,
    created_time: "2024-04-08T10:29:42Z",
    views_count: 0,
    comments_count: 0,
    votes_count: 0,
    author: {
      id: 8000278,
      name: "สมาชิกหมายเลข 8000278",
    },
    tags: [
      { name: "งานโรงงาน", slug: "งานโรงงาน" },
      { name: "โรงงาน", slug: "โรงงาน" },
    ],
  },
  {
    topic_id: 42632029,
    title: "#การเลือกเกณฑ์ทหาร",
    topic_type: 3,
    created_time: "2024-04-08T10:26:03Z",
    views_count: 0,
    comments_count: 0,
    votes_count: 0,
    author: {
      id: 8077207,
      name: "สมาชิกหมายเลข 8077207",
    },
    tags: [{ name: "ทหารเกณฑ์", slug: "ทหารเกณฑ์" }],
  },
  {
    topic_id: 42632027,
    title: "เบิกสิทธิ์จ่ายตรงย้อนหลังราชการ",
    topic_type: 3,
    created_time: "2024-04-08T10:25:04Z",
    views_count: 0,
    comments_count: 0,
    votes_count: 0,
    author: {
      id: 6599860,
      name: "สมาชิกหมายเลข 6599860",
    },
    tags: [
      {
        name: "สิทธิการรักษาพยาบาล",
        slug: "สิทธิการรักษาพยาบาล",
      },
    ],
  },
  {
    topic_id: 42632023,
    title: "ส่งของShopeeโห่ใส่ลูกค้าได้หรอครับ?",
    topic_type: 3,
    created_time: "2024-04-08T10:21:53Z",
    thumbnail_url:
      "https://f.ptcdn.info/772/083/000/sbmcqf2f3wrww2M7XypM7-s.jpg",
    views_count: 0,
    comments_count: 0,
    votes_count: 0,
    author: {
      id: 7111130,
      name: "สมาชิกหมายเลข 7111130",
    },
    tags: [{ name: "Shopee", slug: "Shopee" }],
  },
  {
    topic_id: 42632021,
    title: "ถ้าต้องเลือกระหว่าง ฤดูร้อน ฤดูฝน ฤดูหนาว จะเลือกอยู่อันไหนครับ",
    topic_type: 3,
    created_time: "2024-04-08T10:21:11Z",
    views_count: 0,
    comments_count: 3,
    votes_count: 0,
    author: {
      id: 8024803,
      name: "สมาชิกหมายเลข 8024803",
    },
    tags: [
      { name: "สังคมชาวพันทิป", slug: "สังคมชาวพันทิป" },
      { name: "ภูมิอากาศ", slug: "ภูมิอากาศ" },
      { name: "คุณภาพอากาศ", slug: "คุณภาพอากาศ" },
      { name: "พยากรณ์อากาศ", slug: "พยากรณ์อากาศ" },
    ],
  },
];
export const bangrukPost = [
  {
    topic_id: 42632083,
    title: 'ในวันที่เธอมาบอก "ขออยู่คิดทบทวนคนเดียวสักพักได้ไหม"',
    topic_type: 1,
    created_time: "2024-04-08T10:53:23Z",
    views_count: 0,
    comments_count: 1,
    votes_count: 0,
    author: {
      id: 4008329,
      name: "สมาชิกหมายเลข 4008329",
    },
    tags: [
      { name: "ปัญหาความรัก", slug: "ปัญหาความรัก" },
      { name: "ศาลาคนเศร้า", slug: "ศาลาคนเศร้า" },
      { name: "ศาลาคนโสด", slug: "ศาลาคนโสด" },
      { name: "ประสบการณ์ความรัก", slug: "ประสบการณ์ความรัก" },
    ],
  },
  {
    topic_id: 42632071,
    title: "ผมผิดมั้ยที่ไม่สนใจเขา?",
    topic_type: 3,
    created_time: "2024-04-08T10:46:21Z",
    views_count: 0,
    comments_count: 0,
    votes_count: 0,
    author: {
      id: 8077202,
      name: "สมาชิกหมายเลข 8077202",
    },
    tags: [{ name: "ปัญหาความรัก", slug: "ปัญหาความรัก" }],
  },
  {
    topic_id: 42632039,
    title: "แฟนอายุน้อยกว่าและเราอายุมากกว่า",
    topic_type: 3,
    created_time: "2024-04-08T10:31:34Z",
    views_count: 0,
    comments_count: 3,
    votes_count: 0,
    author: {
      id: 8077214,
      name: "สมาชิกหมายเลข 8077214",
    },
    tags: [
      { name: "ความรักต่างวัย", slug: "ความรักต่างวัย" },
      { name: "ความรักวัยรุ่น", slug: "ความรักวัยรุ่น" },
      { name: "ปัญหาความรัก", slug: "ปัญหาความรัก" },
    ],
  },
  {
    topic_id: 42632033,
    title: "ความรักที่ถูกปิดกั้น",
    topic_type: 3,
    created_time: "2024-04-08T10:27:23Z",
    views_count: 0,
    comments_count: 1,
    votes_count: 0,
    author: {
      id: 8077191,
      name: "สมาชิกหมายเลข 8077191",
    },
    tags: [
      { name: "ศาลาคนโสด", slug: "ศาลาคนโสด" },
      { name: "ความรักวัยรุ่น", slug: "ความรักวัยรุ่น" },
      { name: "ประสบการณ์ความรัก", slug: "ประสบการณ์ความรัก" },
      { name: "ปัญหาความรัก", slug: "ปัญหาความรัก" },
      { name: "ศาลาคนเศร้า", slug: "ศาลาคนเศร้า" },
    ],
  },
  {
    topic_id: 42632018,
    title: "ไม่เคยไม่อยากมีใครเท่าครั้งนี้เลย เป็นฟิลอยากใช้ชีวิตก่อน แปลว่าไง",
    topic_type: 3,
    created_time: "2024-04-08T10:19:07Z",
    views_count: 0,
    comments_count: 1,
    votes_count: 0,
    author: {
      id: 6353401,
      name: "สมาชิกหมายเลข 6353401",
    },
    tags: [{ name: "ศาลาคนโสด", slug: "ศาลาคนโสด" }],
  },
  {
    topic_id: 42631986,
    title: "ทำไงดีถ้าแฟนตัวเองคุยกับคนอื่น",
    topic_type: 3,
    created_time: "2024-04-08T10:00:55Z",
    views_count: 0,
    comments_count: 2,
    votes_count: 0,
    author: {
      id: 7658184,
      name: "สมาชิกหมายเลข 7658184",
    },
    tags: [
      { name: "ประสบการณ์ชีวิตคู่", slug: "ประสบการณ์ชีวิตคู่" },
      { name: "ประสบการณ์ความรัก", slug: "ประสบการณ์ความรัก" },
    ],
  },
  {
    topic_id: 42631981,
    title: "โดนแฟนเก่าฝั่งผช.แซะทำไงดีคะ",
    topic_type: 3,
    created_time: "2024-04-08T09:57:46Z",
    views_count: 0,
    comments_count: 1,
    votes_count: 0,
    author: {
      id: 8044100,
      name: "สมาชิกหมายเลข 8044100",
    },
    tags: [
      { name: "รักสามเส้า", slug: "รักสามเส้า" },
      { name: "ปัญหาความรัก", slug: "ปัญหาความรัก" },
      { name: "แฟนเก่า", slug: "แฟนเก่า" },
    ],
  },
  {
    topic_id: 42631945,
    title: "เค้าคนนั้นจะไม่กลับมาอีกแล้ว เพราะคำว่า “หมดรัก”",
    topic_type: 1,
    created_time: "2024-04-08T09:34:35Z",
    views_count: 0,
    comments_count: 0,
    votes_count: 0,
    author: {
      id: 4724143,
      name: "สมาชิกหมายเลข 4724143",
    },
    tags: [
      { name: "Hurt Room", slug: "Hurt_Room" },
      { name: "ประสบการณ์ชีวิตคู่", slug: "ประสบการณ์ชีวิตคู่" },
      { name: "ศาลาคนเศร้า", slug: "ศาลาคนเศร้า" },
      { name: "ศาลาคนโสด", slug: "ศาลาคนโสด" },
      { name: "ประสบการณ์ความรัก", slug: "ประสบการณ์ความรัก" },
    ],
  },
  {
    topic_id: 42631930,
    title: "แฟนไม่ตอบ ทำไงดี",
    topic_type: 3,
    created_time: "2024-04-08T09:29:41Z",
    views_count: 0,
    comments_count: 2,
    votes_count: 0,
    author: {
      id: 6297026,
      name: "สมาชิกหมายเลข 6297026",
    },
    tags: [
      { name: "ประสบการณ์ความรัก", slug: "ประสบการณ์ความรัก" },
      { name: "ประสบการณ์ชีวิตคู่", slug: "ประสบการณ์ชีวิตคู่" },
    ],
  },
  {
    topic_id: 42631895,
    title: "แฟนชอบออกไปเที่ยว!!",
    topic_type: 3,
    created_time: "2024-04-08T09:14:41Z",
    views_count: 0,
    comments_count: 3,
    votes_count: 0,
    author: {
      id: 8077100,
      name: "สมาชิกหมายเลข 8077100",
    },
    tags: [
      { name: "ประสบการณ์ชีวิตคู่", slug: "ประสบการณ์ชีวิตคู่" },
      { name: "ปัญหาความรัก", slug: "ปัญหาความรัก" },
      { name: "ประสบการณ์ความรัก", slug: "ประสบการณ์ความรัก" },
    ],
  },
  {
    topic_id: 42631876,
    title: "โลกใบที่2",
    topic_type: 3,
    created_time: "2024-04-08T09:03:35Z",
    views_count: 0,
    comments_count: 1,
    votes_count: 0,
    author: {
      id: 4057106,
      name: "สมาชิกหมายเลข 4057106",
    },
    tags: [{ name: "ความรักเพศที่สาม", slug: "ความรักเพศที่สาม" }],
  },
];
export const chalermchaiPost = [
  {
    topic_id: 42632058,
    title:
      'ถ้าพูดถึง "วิทิต แลต" คุณจะนึกถึงผลงานการแสดงละครหรือภาพยนตร์เรื่องใดบ้าง',
    topic_type: 3,
    created_time: "2024-04-08T10:40:05Z",
    thumbnail_url:
      "https://f.ptcdn.info/772/083/000/sbmdl7xga8O4pLNpttc6-s.jpg",
    views_count: 0,
    comments_count: 2,
    votes_count: 0,
    author: {
      id: 6918814,
      name: "สมาชิกหมายเลข 6918814",
    },
    tags: [
      { name: "นักแสดงชาย", slug: "นักแสดงชาย" },
      { name: "7 HD", slug: "7_HD" },
      { name: "3 HD (BEC)", slug: "3_HD_(BEC)" },
      { name: "ละครโทรทัศน์", slug: "ละครโทรทัศน์" },
      { name: "นักแสดงภาพยนตร์", slug: "นักแสดงภาพยนตร์" },
    ],
  },
  {
    topic_id: 42631967,
    title: "เพื่อนๆ คิดว่าบิวกิ้นความหล่อ การแสดงเป็นยังไงบ้างคะ????",
    topic_type: 3,
    created_time: "2024-04-08T09:49:57Z",
    thumbnail_url:
      "https://f.ptcdn.info/772/083/000/sbmbdb956reY4pg5ASIJ-s.jpg",
    views_count: 0,
    comments_count: 0,
    votes_count: 0,
    author: {
      id: 6716982,
      name: "สมาชิกหมายเลข 6716982",
    },
    tags: [
      { name: "นักแสดงชาย", slug: "นักแสดงชาย" },
      {
        name: "นักแสดงภาพยนตร์ไทย",
        slug: "นักแสดงภาพยนตร์ไทย",
      },
      {
        name: "พุฒิพงศ์ อัสสรัตนกุล (บิวกิ้น)",
        slug: "พุฒิพงศ์_อัสสรัตนกุล_(บิวกิ้น)",
      },
      { name: "นักร้องนักดนตรี", slug: "นักร้องนักดนตรี" },
    ],
  },
  {
    topic_id: 42631826,
    title:
      "[#Review] Poor Things - เฝ้ามองการเจริญเติบโตด้วยสัญชาตญาณดิบของมนุษย์ กับฉาก 18+ ที่เป็นแค่องค์ประกอบเล็กๆ",
    topic_type: 4,
    created_time: "2024-04-08T08:34:47Z",
    thumbnail_url:
      "https://f.ptcdn.info/771/083/000/sbm7pqsdd6291SdgCVSe-s.jpg",
    views_count: 0,
    comments_count: 0,
    votes_count: 0,
    author: {
      id: 484932,
      name: "ekka_eak",
    },
    is_cr: true,
    is_sr: false,
    is_br: false,
    tags: [
      { name: "ภาพยนตร์ชีวิต", slug: "ภาพยนตร์ชีวิต" },
      {
        name: "ภาพยนตร์ต่างประเทศ",
        slug: "ภาพยนตร์ต่างประเทศ",
      },
      { name: "ภาพยนตร์", slug: "ภาพยนตร์" },
      { name: "Emma Stone", slug: "Emma_Stone" },
      {
        name: "Poor Things (ภาพยนตร์)",
        slug: "Poor_Things_(ภาพยนตร์)",
      },
    ],
  },
  {
    topic_id: 42631771,
    title:
      "ถ้าให้Christopher Nolanมาเป็นผู้กำกับเรื่องTop Gun: Maverick ปี2022โดยนำกลับมาremakeทำใหม่หมดคุณจะตีตั๋วเข้าไปดูกันไหม",
    topic_type: 3,
    created_time: "2024-04-08T08:07:25Z",
    views_count: 0,
    comments_count: 0,
    votes_count: 0,
    author: {
      id: 163227,
      name: "okb",
    },
    tags: [
      { name: "ภาพยนตร์", slug: "ภาพยนตร์" },
      { name: "นักแสดง", slug: "นักแสดง" },
    ],
  },
  {
    topic_id: 42631724,
    title: "รีวิว  MayDecember (2023) สนุกมาก แต่พีคได้อีก!",
    topic_type: 1,
    created_time: "2024-04-08T07:47:59Z",
    thumbnail_url:
      "https://f.ptcdn.info/771/083/000/sbm5nd1u3u8gpbUPVqsza-s.jpg",
    views_count: 0,
    comments_count: 1,
    votes_count: 0,
    author: {
      id: 2720957,
      name: "สมาชิกหมายเลข 2720957",
    },
    tags: [
      {
        name: "ภาพยนตร์ระทึกขวัญ",
        slug: "ภาพยนตร์ระทึกขวัญ",
      },
      {
        name: "ภาพยนตร์ต่างประเทศ",
        slug: "ภาพยนตร์ต่างประเทศ",
      },
      { name: "Hollywood", slug: "Hollywood" },
      { name: "นักแสดงฝรั่ง", slug: "นักแสดงฝรั่ง" },
      { name: "นักแสดงภาพยนตร์", slug: "นักแสดงภาพยนตร์" },
    ],
  },
  {
    topic_id: 42631699,
    title: "อยากดูหนังใหม่ค่าาาา",
    topic_type: 3,
    created_time: "2024-04-08T07:37:46Z",
    views_count: 0,
    comments_count: 0,
    votes_count: 0,
    author: {
      id: 7973353,
      name: "สมาชิกหมายเลข 7973353",
    },
    tags: [
      { name: "SF Cinema", slug: "SF_Cinema" },
      { name: "Major Cineplex", slug: "Major_Cineplex" },
      { name: "โรงภาพยนตร์", slug: "โรงภาพยนตร์" },
      { name: "ภาพยนตร์", slug: "ภาพยนตร์" },
      { name: "บัตรชมภาพยนตร์", slug: "บัตรชมภาพยนตร์" },
    ],
  },
  {
    topic_id: 42631686,
    title: "มีนางเอกคนไหนบ้างที่เล่นบทเบาๆแล้วเกิด",
    topic_type: 3,
    created_time: "2024-04-08T07:27:05Z",
    views_count: 0,
    comments_count: 4,
    votes_count: 0,
    author: {
      id: 7477321,
      name: "สมาชิกหมายเลข 7477321",
    },
    tags: [
      { name: "นักแสดงหญิง", slug: "นักแสดงหญิง" },
      { name: "ละครโทรทัศน์", slug: "ละครโทรทัศน์" },
      { name: "ซีรีส์ไทย", slug: "ซีรีส์ไทย" },
      { name: "ภาพยนตร์ไทย", slug: "ภาพยนตร์ไทย" },
    ],
  },
  {
    topic_id: 42631267,
    title:
      "Premium Blockbuster วันที่ 8 - 14 เมษายน เวลา 18.00 น. ทางช่อง MONO29",
    topic_type: 5,
    created_time: "2024-04-08T03:25:10Z",
    thumbnail_url:
      "https://f.ptcdn.info/768/083/000/sbltfl1gtkpmZR1G7WeZr-s.jpg",
    views_count: 0,
    comments_count: 0,
    votes_count: 0,
    author: {
      id: 5319072,
      name: "MONO29",
    },
    tags: [
      { name: "MONO 29", slug: "MONO_29" },
      {
        name: "ภาพยนตร์ต่างประเทศ",
        slug: "ภาพยนตร์ต่างประเทศ",
      },
      {
        name: "ภาพยนตร์แอ็คชั่น",
        slug: "ภาพยนตร์แอ็คชั่น",
      },
      {
        name: "ภาพยนตร์ระทึกขวัญ",
        slug: "ภาพยนตร์ระทึกขวัญ",
      },
      { name: "ภาพยนตร์แฟนตาซี", slug: "ภาพยนตร์แฟนตาซี" },
    ],
  },
  {
    topic_id: 42631100,
    title:
      "คือว่ายังไม่ได้ดูหนังเรื่อง หลานม่า นะแต่ฟังรีวิวมาประมาณหนึ่ง ในความรู้สึกประเด็นเริ่มจากหวังในมรดกทำไมใช่ประเด็นได้แย่",
    topic_type: 1,
    created_time: "2024-04-08T01:39:40Z",
    views_count: 0,
    comments_count: 4,
    votes_count: 0,
    author: {
      id: 8029013,
      name: "สมาชิกหมายเลข 8029013",
    },
    tags: [
      {
        name: "ภาพยนตร์ครอบครัว",
        slug: "ภาพยนตร์ครอบครัว",
      },
      { name: "ภาพยนตร์รัก", slug: "ภาพยนตร์รัก" },
      { name: "แนะนำภาพยนตร์", slug: "แนะนำภาพยนตร์" },
      { name: "ภาพยนตร์ไทย", slug: "ภาพยนตร์ไทย" },
      {
        name: "หลานม่า (ภาพยนตร์ไทย)",
        slug: "หลานม่า_(ภาพยนตร์ไทย)",
      },
    ],
  },
  {
    topic_id: 42630922,
    title: "แนะนำหนัง/ซีรี่ส์พีเรียดไทยหน่อยค่ะ",
    topic_type: 3,
    created_time: "2024-04-07T20:47:39Z",
    views_count: 0,
    comments_count: 2,
    votes_count: 0,
    author: {
      id: 6133764,
      name: "สมาชิกหมายเลข 6133764",
    },
    tags: [
      { name: "ภาพยนตร์", slug: "ภาพยนตร์" },
      { name: "ภาพยนตร์ไทย", slug: "ภาพยนตร์ไทย" },
      { name: "บ้านทรายทอง", slug: "บ้านทรายทอง" },
      { name: "แนะนำภาพยนตร์", slug: "แนะนำภาพยนตร์" },
    ],
  },
  {
    topic_id: 42630894,
    title: "ศรราม เทพพิทักษ์นี่ จริงๆเขาสูงเท่าไรกันแน่ครับ",
    topic_type: 3,
    created_time: "2024-04-07T19:38:10Z",
    thumbnail_url:
      "https://f.ptcdn.info/766/083/000/sbl7tl9qrr1cjjjRyvqf-s.png",
    views_count: 0,
    comments_count: 1,
    votes_count: 0,
    author: {
      id: 376755,
      name: "จักรพรรดิแดนรักทหารErosPhoenix",
    },
    tags: [
      { name: "นักแสดงภาพยนตร์", slug: "นักแสดงภาพยนตร์" },
      { name: "นักแสดง", slug: "นักแสดง" },
    ],
  },
];
